a =['蝶结', '很仙的', '泫雅风', '炸街', '慵懒风', '赫本风', '阔太太', '发型师', '露锁骨', '雾霾蓝', '打底衫', '蝙蝠衫', '好看的', '温柔风', '冷淡风', '痞帅', '超火的', '任意剪', '蛤蟆镜', '有口袋', '不卷边', '售楼部', '黑科技', '平光镜', '真口袋', '隐形袜', '菠萝袜', '魏晋风', '沧海赋', '姐妹团', '易冧', '复古风', '机能风', '冒孑', '皮夹克', '丅血', '颗粒绒', '漏肚脐', '坠感', '喜婆婆', '防下垂', '眼镜架', '夹克衫', '胖大码', '有度数', '雪纺衫', '盐系', '眼镜框', '文胸罩', '水晶袜', '全透明', '莲依群', '放心购', '羊毛衫', '防晒衫', '应援', '遮肚', '形象岗', '柒月雅', '蓓蕾帽', '过膝盖', '垂坠感', '高级感', '蜜桃臀', '翻领恤', '防凸点', '朴珀妮', '连帽衫', '到脚踝', '翻领衫', '冰丝绸', '有钢圈', '反光条', '后厨房', '漏锁骨', '一体绒', '半拉链', '毕业照', '眼睛框', '折扣店', '勒为', '藏肉', '黄金貂', '无袖恤', '寸杉', '痞帅气', '圆领恤', '便宜的', '伴郎团', '带口袋', '山羊绒', '茸戎', '超大码', '近视镜', '针织帽', '狂欢节', '篮球袜', '以白纯', '改良版', '双面呢', '欧美风', '四十岁', '娃娃衫', '偏光镜', '龙凤褂', '岁爷爷', '袜吸汗', '斤可穿', '二八月', '洋气质', '恶搞笑', '内穿', '束脚', '兄弟团', '高跟鞋', '防飞沫', '丅桖', '直筒型', '可出门', '细带', '赖冠霖', '沙滩帽', '平顶帽', '显瘦字', '答谢宴', '好货', '高街', '伴娘团', '蚀骨', '轻商务', '显瘦胖', '少女士', '穿的', '月经期', '毛巾袜', '性感惑', '短袖恤', '高腰字', '弯檐', '字阔腿', '乔僖枫', '不掉跟', '岁妈妈', '拉链衫', '防唾沫', '三角杯', '条纹衫', '抢先购', '斤胖', '百搭恤', '分趾袜', '宽松恤', '胖显瘦', '单西', '哆啦梦', '茶歇', '裸感', '框眼镜', '简约风', '唯坤', '裹胸式', '好品质', '防晒帽', '岁左右', '嘻哈风', '印花恤', '瓜皮帽', '纯棉裆', '冰氧吧', '防污', '体桖衫', '折叠伞', '到岁', '库孑', '睡眠袜', '帽护耳', '内外穿', '关西襟', '眼睛架', '抖音', '玛杰饰', '宽松版', '钟晓芹']
b= ['蝶结', '雾霾蓝', '很仙的', '蛤蟆镜', '泫雅风', '露锁骨', '冷淡风', '赫本风', '阔太太', '炸街', '慵懒风', '任意剪', '售楼部', '温柔风', '发型师', '打底衫', '蝙蝠衫', '好看的', '超火的', '易冧', '有口袋', '真口袋', '魏晋风', '痞帅', '漏锁骨', '菠萝袜', '姐妹团', '黑科技', '冒孑', '平光镜', '刺绣花', '隐形袜', '丅血', '莲依群', '不卷边', '有度数', '复古风', '颗粒绒', '放心购', '已注册', '机能风', '水晶袜', '盐系', '近视镜', '全透明', '沧海赋', '过膝盖', '胖大码', '恶搞笑', '漏肚脐', '娃娃衫', '夹克衫', '龙凤褂', '垂坠感', '皮夹克', '眼镜架', '玫瑰花', '黄金貂', '蜜桃臀', '眼镜框', '文胸罩', '兄弟团', '防下垂', '琵琶袖', '形象岗', '冰氧吧', '细带', '藏肉', '连帽衫', '半拉链', '带口袋', '欧美风', '后厨房', '坠感', '哆啦梦', '御姐范', '应援', '斤可穿', '漂亮的', '座山雕', '雪纺衫', '愉贵妃', '钟晓芹', '翻领衫', '护颈椎', '月经期', '防晒衫', '柒月雅', '高级感', '嘻哈风', '喜婆婆', '库孑', '便宜的', '蓓蕾帽', '防飞沫', '蚂蚁皱', '不掉跟', '遮肚', '到脚踝', '防尴尬', '有钢圈', '高跟鞋', '简约风', '眼睛架', '蚀骨', '毕业照', '针织帽', '翻领恤', '羊毛衫', '防凸点', '三角杯', '朴珀妮', '双面呢', '超大码', '性感惑', '圆领恤', '可出门', '答谢宴', '篮球袜', '折扣店', '勒为', '懒惰风', '一体绒', '茸戎', '水兵舞', '伴郎团', '赖冠霖', '四十岁', '山羊绒', '岁左右', '寸杉', '分趾袜', '及踝', '洋气质', '偏光镜', '以白纯', '轻商务', '蛋糕店', '兔姬舍', '内穿', '指触屏', '梵戴克', '平顶帽', '烘焙师', '少女士', '京弗', '袜吸汗', '五趾袜', '岁爷爷', '狂欢节', '允染', '改良版', '高帮鞋', '阿米娅', '纯棉裆', '过膝袜', '定制印', '冰丝绸', '直筒型', '运动袜', '显瘦胖', '好货', '八重樱', '可开票', '束脚', '耐脏', '内外穿', '三醋酸', '佛系', '条纹衫', '到岁', '高街']
c = ['蝶结', '雾霾蓝', '冷淡风', '很仙的', '蛤蟆镜', '泫雅风', '赫本风', '任意剪', '露锁骨', '恶搞笑', '易冧', '黑科技', '发型师', '漏锁骨', '售楼部', '温柔风', '炸街', '蚂蚁皱', '愉贵妃', '慵懒风', '超火的', '阔太太', '好看的', '蝙蝠衫', '哆啦梦', '机能风', '蜜桃臀', '打底衫', '放心购', '玫瑰花', '过膝盖', '菠萝袜', '护颈椎', '已注册', '魏晋风', '冒孑', '有口袋', '痞帅', '隐形袜', '真口袋', '随心裁', '挑丨逗', '刺绣花', '半拉链', '毕业照', '平光镜', '兄弟团', '莲依群', '丅血', '座山雕', '颗粒绒', '有度数', '形象岗', '不卷边', '防尴尬', '近视镜', '懒惰风', '沧海赋', '漏肚脐', '眼镜框', '冰氧吧', '娃娃衫', '姐妹团', '复古风', '简约风', '水晶袜', '二八月', '吃鸡', '藏肉', '细带', '反光条', '龙凤褂', '歌菲淇', '斤可穿', '眼睛架', '御姐范', '答谢宴', '黑暗系', '全透明', '欧美风', '夹克衫', '兔姬舍', '八重樱', '垂坠感', '库孑', '水兵舞', '烧烤店', '幺彡', '防飞沫', '带口袋', '札幌襟', '烘焙师', '胖大码', '黄金貂', '颓废风', '防下垂', '水墨画', '蓓蕾帽', '橄榄绿', '揹揹佳', '防凸点', '偏光镜', '坠感', '后厨房', '文胸罩', '三醋酸', '有钢圈', '防晒衫', '皮夹克', '春夏季', '连帽衫', '眼镜架', '虞书欣', '应援', '依迪筱', '便宜的', '梵戴克', '蚀骨', '勒为', '钟晓芹', '李婉君', '嘻哈风', '京弗', '岁儿童', '婴儿童', '联名恤', '可出门', '到脚踝', '轰焦冻', '水桶帽', '雪纺衫', '蜈蚣纱', '不掉档', '月经期', '允染', '翻领恤', '篮球袜', '三角杯', '蛋糕店', '盐系', '成熟风', '不掉跟', '可开票', '朴珀妮', '翻领衫', '高级感', '腈纶帽', '漂亮的', '丧系', '黛楼', '鲛人泪', '兔先森', '柒月雅', '钓鱼帽', '喜婆婆', '偌聿', '针织帽', '阿米娅', '斜挎包', '徐姑姑', '茸戎', '张楚岚', '不惑鸟', '凹造型', '沙滩帽', '赖冠霖', '寸杉', '琵琶袖', '纪念品', '圆领恤', '售楼处', '允鹿', '折扣店', '中筒袜', '耐脏', '超大码', '炭治郎', '属鼠年', '中高腰', '遮肚', '卡通风', '跳舞蹈', '羊毛衫', '高跟鞋']

aset=set(a)
bset=set(b)
cset=set(c)

ab = 0
ac = 0
for ta in a:
    if ta not in bset:
        ab += 1
    
    if ta not in cset:
        ac += 1

ba = 0
bc = 0
for tb in b:
    if tb not in aset:
        ba += 1
    if tb not in cset:
        bc += 1

ca = 0
cb = 0
for tc in c:
    if tc not in aset:
        ca += 1
    if tc not in bset:
        cb += 1

print("the diff number of ab:",ab)
print("the diff number of ac:",ac)
print("the diff number of ba:",ba)
print("the diff number of bc:",bc)
print("the diff number of ca:",ca)
print("the diff number of cb:",cb)


